## Quiz #0203

In [ ]:
import pandas as pd
import numpy as np
import os

#### Read in the data.

In [ ]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')                # Please, replace the path with your own.

In [ ]:
df = pd.read_csv('data_sales.csv', header='infer')

In [ ]:
df.shape

(43, 5)

In [ ]:
df.head(5)

          Date   Region     Item  UnitPrice  Units
0   4-Jul-2014     East  Pen Set       4.99     62
1  12-Jul-2014     East   Binder       1.99     29
2  21-Jul-2014  Central  Pen Set      12.49     55
3  29-Jul-2014     East   Binder      19.99     81
4   7-Aug-2014  Central  Pen Set      23.95     42

#### Answer the following questions.

1). Append a new variable $Amount = UnitPric \times Units$.

In [ ]:
Amount= df['UnitPrice']* df['Units']
Amount

0      309.38
1       57.71
2      686.95
3     1619.19
4     1005.90
5      174.65
6      825.00
7      250.00
8        9.03
9      255.84
10     151.24
11     251.72
12    1139.43
13     575.36
14      18.06
15     299.85
16      54.89
17     479.04
18    1879.06
19      86.43
20     139.72
21    1183.26
22     189.05
23     413.54
24     999.50
25    1305.00
26     179.64
27      19.96
28     539.73
29     139.93
30     167.44
31     249.50
32     299.40
33     131.34
34     149.25
35     479.04
36     449.10
37      68.37
38      63.68
39     719.20
40     539.40
41     625.00
42     449.10
dtype: float64

2). Average unit price for each region. Use the groupby() method.

In [ ]:
df.groupby('Region')['UnitPrice'].mean()

Region
Central    18.018750
East        9.143846
West       53.658333
Name: UnitPrice, dtype: float64

3). Average unit price for each region. Use the pivot_table() method.

In [ ]:
df.pivot_table(index = 'Region', values = 'UnitPrice', aggfunc=np.mean)

         UnitPrice
Region
Central  18.018750
East      9.143846
West     53.658333

4). Average unit price and units for each region in one code sentence. Use the groupby() method.

In [ ]:
df.groupby('Region')[['UnitPrice', 'Units']].mean()

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

5). Average unit price and units for each region in one code sentence. Use the pivot_table() method.

In [ ]:
df.pivot_table(index = 'Region', values = ['UnitPrice','Units'], aggfunc=np.mean)

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

6). Total units for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [ ]:
df.pivot_table(index='Region', columns = 'Item', values = 'Units', aggfunc=np.sum, fill_value=0 )

Item     Binder  Desk  Pen  Pen Set  Pencil
Region
Central     424     7   27      243     498
East        234     0  175      152     130
West         64     3   76        0      88

7). Total sales amount for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [ ]:
df.pivot_table(index='Region', columns = 'Item', values = ['UnitPrice','Units'], aggfunc=np.sum, fill_value=0 )

        UnitPrice                             Units
Item       Binder Desk    Pen Pen Set Pencil Binder Desk  Pen Pen Set Pencil
Region
Central     91.93  250  19.99   46.42  24.11    424    7   27     243    498
East        40.95    0  33.97   36.97   6.98    234    0  175     152    130
West        39.98  275   1.99    0.00   4.98     64    3   76       0     88